Revit 2026 API
ISelectionFilter Interface
An interface that provides the ability to filter objects during a selection operation.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public interface ISelectionFilter
Public Interface ISelectionFilter
public interface class ISelectionFilter
type ISelectionFilter = interface end
The ISelectionFilter type exposes the following members.
Methods
Name | Description
AllowElement | Override this pre-filter method to specify if the element should be permitted to be selected.
AllowReference | Override this post-filter method to specify if a reference to a piece of geometry is permitted to be selected.
Top
See Also
Reference
Autodesk.Revit.UI.Selection Namespace